# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
import numpy as np
import random

In [6]:
sr_1=pd.Series(np.random.randint(1,high=5,size=100))
sr_1

0     3
1     3
2     2
3     3
4     3
     ..
95    3
96    1
97    2
98    2
99    2
Length: 100, dtype: int32

In [7]:
sr_2=pd.Series(np.random.randint(1,high=4,size=100))
sr_2

0     1
1     2
2     1
3     1
4     1
     ..
95    3
96    2
97    3
98    1
99    3
Length: 100, dtype: int32

In [9]:
sr_3=pd.Series(np.random.randint(10000,high=30001,size=100))
sr_3

0     21579
1     22160
2     22284
3     16057
4     10839
      ...
95    20534
96    29597
97    15907
98    16597
99    14564
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
df=pd.concat([sr_1,sr_2,sr_3],axis=1)
df

    0  1      2
0   3  1  21579
1   3  2  22160
2   2  1  22284
3   3  1  16057
4   3  1  10839
.. .. ..    ...
95  3  3  20534
96  1  2  29597
97  2  3  15907
98  2  1  16597
99  2  3  14564

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [12]:
df.columns=['bedrs','bathrs','price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       3       1            21579
1       3       2            22160
2       2       1            22284
3       3       1            16057
4       3       1            10839
..    ...     ...              ...
95      3       3            20534
96      1       2            29597
97      2       3            15907
98      2       1            16597
99      2       3            14564

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [17]:
sr=pd.concat([sr_1,sr_2,sr_3],axis=0)
df_2=sr.to_frame()
df_2

        0
0       3
1       3
2       2
3       3
4       3
..    ...
95  20534
96  29597
97  15907
98  16597
99  14564

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [18]:
df_2.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [19]:
df_2.index=range(0,300)
df_2

         0
0        3
1        3
2        2
3        3
4        3
..     ...
295  20534
296  29597
297  15907
298  16597
299  14564

[300 rows x 1 columns]

In [ ]:
# Cách 2:
df_2.reset_index(drop=True, inplace=True)
df_2